# Pandas

In [19]:
import numpy as np
import pandas as pd
pd.__version__

'1.3.3'

# Object creation

In [20]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [21]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df = pd.DataFrame(np.random.randn(6,5), index=dates, columns=list("ABDCX"))
df

                   A         B         D         C         X
2013-01-01  1.101705 -1.643001 -0.666784  0.055356  2.211939
2013-01-02  1.674656  0.342139 -0.767423 -1.771765 -0.184457
2013-01-03  0.937461  0.708011 -0.856922 -1.414944  1.045815
2013-01-04 -0.245622  0.040975 -0.706176 -0.071897 -0.165725
2013-01-05  0.272130 -0.830056  0.575562 -0.587912  0.879478
2013-01-06  1.506126 -1.202471  1.437215  0.454408 -0.090974

In [23]:
np.random.randn(6,4)

array([[ 1.21540594e+00, -2.91025014e+00,  7.84547260e-02,
        -5.41404146e-01],
       [ 6.87219661e-04, -8.18364344e-01, -3.73944130e-01,
         7.05490942e-01],
       [ 2.65032991e-01, -9.67132349e-01,  1.29762146e+00,
         5.72821178e-02],
       [-1.94349471e+00,  2.08704296e-01, -1.18256826e+00,
         1.00305342e+00],
       [-1.18550084e+00,  8.57686835e-01, -4.02342062e-01,
        -2.88124256e-01],
       [-1.43729496e+00, -7.73641896e-01,  5.96009744e-01,
         2.36674070e+00]])

In [24]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)),dtype="float32"),
        "D": np.array([3]*4,dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo"
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [25]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing data

In [26]:
df.head()

                   A         B         D         C         X
2013-01-01  1.101705 -1.643001 -0.666784  0.055356  2.211939
2013-01-02  1.674656  0.342139 -0.767423 -1.771765 -0.184457
2013-01-03  0.937461  0.708011 -0.856922 -1.414944  1.045815
2013-01-04 -0.245622  0.040975 -0.706176 -0.071897 -0.165725
2013-01-05  0.272130 -0.830056  0.575562 -0.587912  0.879478

In [27]:
df.tail(4)

                   A         B         D         C         X
2013-01-03  0.937461  0.708011 -0.856922 -1.414944  1.045815
2013-01-04 -0.245622  0.040975 -0.706176 -0.071897 -0.165725
2013-01-05  0.272130 -0.830056  0.575562 -0.587912  0.879478
2013-01-06  1.506126 -1.202471  1.437215  0.454408 -0.090974

In [28]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [29]:
df.columns

Index(['A', 'B', 'D', 'C', 'X'], dtype='object')

In [30]:
df.to_numpy()

array([[ 1.10170454, -1.64300131, -0.66678446,  0.05535647,  2.21193909],
       [ 1.67465613,  0.34213885, -0.76742341, -1.77176507, -0.18445733],
       [ 0.93746149,  0.70801106, -0.85692191, -1.41494396,  1.04581458],
       [-0.24562155,  0.0409752 , -0.70617569, -0.07189748, -0.16572539],
       [ 0.27212985, -0.83005612,  0.57556161, -0.58791153,  0.87947762],
       [ 1.50612556, -1.20247118,  1.43721473,  0.45440752, -0.09097436]])

In [31]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [32]:
df.describe()

              A         B         D         C         X
count  6.000000  6.000000  6.000000  6.000000  6.000000
mean   0.874409 -0.430734 -0.164088 -0.556126  0.616012
std    0.736520  0.931795  0.948878  0.877032  0.954235
min   -0.245622 -1.643001 -0.856922 -1.771765 -0.184457
25%    0.438463 -1.109367 -0.752111 -1.208186 -0.147038
50%    1.019583 -0.394540 -0.686480 -0.329905  0.394252
75%    1.405020  0.266848  0.264975  0.023543  1.004230
max    1.674656  0.708011  1.437215  0.454408  2.211939

In [33]:
df

                   A         B         D         C         X
2013-01-01  1.101705 -1.643001 -0.666784  0.055356  2.211939
2013-01-02  1.674656  0.342139 -0.767423 -1.771765 -0.184457
2013-01-03  0.937461  0.708011 -0.856922 -1.414944  1.045815
2013-01-04 -0.245622  0.040975 -0.706176 -0.071897 -0.165725
2013-01-05  0.272130 -0.830056  0.575562 -0.587912  0.879478
2013-01-06  1.506126 -1.202471  1.437215  0.454408 -0.090974

In [34]:
df.sort_index(axis=1, ascending=False)

                   X         D         C         B         A
2013-01-01  2.211939 -0.666784  0.055356 -1.643001  1.101705
2013-01-02 -0.184457 -0.767423 -1.771765  0.342139  1.674656
2013-01-03  1.045815 -0.856922 -1.414944  0.708011  0.937461
2013-01-04 -0.165725 -0.706176 -0.071897  0.040975 -0.245622
2013-01-05  0.879478  0.575562 -0.587912 -0.830056  0.272130
2013-01-06 -0.090974  1.437215  0.454408 -1.202471  1.506126

In [35]:
df.sort_values(by="X", ascending=False)

                   A         B         D         C         X
2013-01-01  1.101705 -1.643001 -0.666784  0.055356  2.211939
2013-01-03  0.937461  0.708011 -0.856922 -1.414944  1.045815
2013-01-05  0.272130 -0.830056  0.575562 -0.587912  0.879478
2013-01-06  1.506126 -1.202471  1.437215  0.454408 -0.090974
2013-01-04 -0.245622  0.040975 -0.706176 -0.071897 -0.165725
2013-01-02  1.674656  0.342139 -0.767423 -1.771765 -0.184457

# Getting

In [36]:
df.D

2013-01-01   -0.666784
2013-01-02   -0.767423
2013-01-03   -0.856922
2013-01-04   -0.706176
2013-01-05    0.575562
2013-01-06    1.437215
Freq: D, Name: D, dtype: float64

In [37]:
df[0:2]

                   A         B         D         C         X
2013-01-01  1.101705 -1.643001 -0.666784  0.055356  2.211939
2013-01-02  1.674656  0.342139 -0.767423 -1.771765 -0.184457

In [38]:
df["2013-01-05":"2013-01-06"]

                   A         B         D         C         X
2013-01-05  0.272130 -0.830056  0.575562 -0.587912  0.879478
2013-01-06  1.506126 -1.202471  1.437215  0.454408 -0.090974

# Selection by label

In [39]:
df.loc[dates[0]]

A    1.101705
B   -1.643001
D   -0.666784
C    0.055356
X    2.211939
Name: 2013-01-01 00:00:00, dtype: float64

In [40]:
df

                   A         B         D         C         X
2013-01-01  1.101705 -1.643001 -0.666784  0.055356  2.211939
2013-01-02  1.674656  0.342139 -0.767423 -1.771765 -0.184457
2013-01-03  0.937461  0.708011 -0.856922 -1.414944  1.045815
2013-01-04 -0.245622  0.040975 -0.706176 -0.071897 -0.165725
2013-01-05  0.272130 -0.830056  0.575562 -0.587912  0.879478
2013-01-06  1.506126 -1.202471  1.437215  0.454408 -0.090974

In [41]:
df.loc[:,["D","X"]]

                   D         X
2013-01-01 -0.666784  2.211939
2013-01-02 -0.767423 -0.184457
2013-01-03 -0.856922  1.045815
2013-01-04 -0.706176 -0.165725
2013-01-05  0.575562  0.879478
2013-01-06  1.437215 -0.090974

In [42]:
df.loc["2013-01-02":"2013-01-03", ["X", "C","D"]]

                   X         C         D
2013-01-02 -0.184457 -1.771765 -0.767423
2013-01-03  1.045815 -1.414944 -0.856922

In [43]:
df.loc["20130103", "C"]

-1.4149439615692063

In [44]:
df.at[dates[2],"X"]

1.045814583429909

In [45]:
df.iloc[1]

A    1.674656
B    0.342139
D   -0.767423
C   -1.771765
X   -0.184457
Name: 2013-01-02 00:00:00, dtype: float64

In [46]:
df.iloc[3:5, 2:]

                   D         C         X
2013-01-04 -0.706176 -0.071897 -0.165725
2013-01-05  0.575562 -0.587912  0.879478

In [47]:
df.iloc[[1,3,4],[2,0]]

                   D         A
2013-01-02 -0.767423  1.674656
2013-01-04 -0.706176 -0.245622
2013-01-05  0.575562  0.272130

In [48]:
df.iloc[0:3,:]

                   A         B         D         C         X
2013-01-01  1.101705 -1.643001 -0.666784  0.055356  2.211939
2013-01-02  1.674656  0.342139 -0.767423 -1.771765 -0.184457
2013-01-03  0.937461  0.708011 -0.856922 -1.414944  1.045815

In [49]:
df.iloc[:,0:3]

                   A         B         D
2013-01-01  1.101705 -1.643001 -0.666784
2013-01-02  1.674656  0.342139 -0.767423
2013-01-03  0.937461  0.708011 -0.856922
2013-01-04 -0.245622  0.040975 -0.706176
2013-01-05  0.272130 -0.830056  0.575562
2013-01-06  1.506126 -1.202471  1.437215

In [50]:
df.iloc[1,1]

0.34213884930600647

In [51]:
df.iat[0,0]

1.1017045417049538

# Boolean indexing

In [52]:
df[df["A"]>0]

                   A         B         D         C         X
2013-01-01  1.101705 -1.643001 -0.666784  0.055356  2.211939
2013-01-02  1.674656  0.342139 -0.767423 -1.771765 -0.184457
2013-01-03  0.937461  0.708011 -0.856922 -1.414944  1.045815
2013-01-05  0.272130 -0.830056  0.575562 -0.587912  0.879478
2013-01-06  1.506126 -1.202471  1.437215  0.454408 -0.090974

In [53]:
df[df<0]

                   A         B         D         C         X
2013-01-01       NaN -1.643001 -0.666784       NaN       NaN
2013-01-02       NaN       NaN -0.767423 -1.771765 -0.184457
2013-01-03       NaN       NaN -0.856922 -1.414944       NaN
2013-01-04 -0.245622       NaN -0.706176 -0.071897 -0.165725
2013-01-05       NaN -0.830056       NaN -0.587912       NaN
2013-01-06       NaN -1.202471       NaN       NaN -0.090974

## Using two column values to select data

In [54]:
df[(df["A"]>0) & (df["D"]<0)]

                   A         B         D         C         X
2013-01-01  1.101705 -1.643001 -0.666784  0.055356  2.211939
2013-01-02  1.674656  0.342139 -0.767423 -1.771765 -0.184457
2013-01-03  0.937461  0.708011 -0.856922 -1.414944  1.045815

In [55]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         D         C         X      E
2013-01-01  1.101705 -1.643001 -0.666784  0.055356  2.211939    one
2013-01-02  1.674656  0.342139 -0.767423 -1.771765 -0.184457    one
2013-01-03  0.937461  0.708011 -0.856922 -1.414944  1.045815    two
2013-01-04 -0.245622  0.040975 -0.706176 -0.071897 -0.165725  three
2013-01-05  0.272130 -0.830056  0.575562 -0.587912  0.879478   four
2013-01-06  1.506126 -1.202471  1.437215  0.454408 -0.090974  three

In [56]:
df2[df2["E"].isin(["one", "three"])]

                   A         B         D         C         X      E
2013-01-01  1.101705 -1.643001 -0.666784  0.055356  2.211939    one
2013-01-02  1.674656  0.342139 -0.767423 -1.771765 -0.184457    one
2013-01-04 -0.245622  0.040975 -0.706176 -0.071897 -0.165725  three
2013-01-06  1.506126 -1.202471  1.437215  0.454408 -0.090974  three

# Setting

In [57]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range("20130102", periods=6))
s1
df["F"] = s1

In [58]:
df.at[dates[0], "B"] = 0

In [59]:
df.iat[0,1] = 0
df

                   A         B         D         C         X    F
2013-01-01  1.101705  0.000000 -0.666784  0.055356  2.211939  NaN
2013-01-02  1.674656  0.342139 -0.767423 -1.771765 -0.184457  1.0
2013-01-03  0.937461  0.708011 -0.856922 -1.414944  1.045815  2.0
2013-01-04 -0.245622  0.040975 -0.706176 -0.071897 -0.165725  3.0
2013-01-05  0.272130 -0.830056  0.575562 -0.587912  0.879478  4.0
2013-01-06  1.506126 -1.202471  1.437215  0.454408 -0.090974  5.0

In [60]:
df.loc[:, "D"]

2013-01-01   -0.666784
2013-01-02   -0.767423
2013-01-03   -0.856922
2013-01-04   -0.706176
2013-01-05    0.575562
2013-01-06    1.437215
Freq: D, Name: D, dtype: float64

In [61]:
df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B  D         C         X    F
2013-01-01  1.101705  0.000000  5  0.055356  2.211939  NaN
2013-01-02  1.674656  0.342139  5 -1.771765 -0.184457  1.0
2013-01-03  0.937461  0.708011  5 -1.414944  1.045815  2.0
2013-01-04 -0.245622  0.040975  5 -0.071897 -0.165725  3.0
2013-01-05  0.272130 -0.830056  5 -0.587912  0.879478  4.0
2013-01-06  1.506126 -1.202471  5  0.454408 -0.090974  5.0

In [62]:
df2 = df.copy()
df2[df2>0] = -df2
df2

                   A         B  D         C         X    F
2013-01-01 -1.101705  0.000000 -5 -0.055356 -2.211939  NaN
2013-01-02 -1.674656 -0.342139 -5 -1.771765 -0.184457 -1.0
2013-01-03 -0.937461 -0.708011 -5 -1.414944 -1.045815 -2.0
2013-01-04 -0.245622 -0.040975 -5 -0.071897 -0.165725 -3.0
2013-01-05 -0.272130 -0.830056 -5 -0.587912 -0.879478 -4.0
2013-01-06 -1.506126 -1.202471 -5 -0.454408 -0.090974 -5.0

# Missing data

In [63]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B  D         C         X    F    E
2013-01-01  1.101705  0.000000  5  0.055356  2.211939  NaN  1.0
2013-01-02  1.674656  0.342139  5 -1.771765 -0.184457  1.0  1.0
2013-01-03  0.937461  0.708011  5 -1.414944  1.045815  2.0  NaN
2013-01-04 -0.245622  0.040975  5 -0.071897 -0.165725  3.0  NaN

In [64]:
df1.dropna(how="any")

                   A         B  D         C         X    F    E
2013-01-02  1.674656  0.342139  5 -1.771765 -0.184457  1.0  1.0

In [65]:
df1.fillna(value=5)

                   A         B  D         C         X    F    E
2013-01-01  1.101705  0.000000  5  0.055356  2.211939  5.0  1.0
2013-01-02  1.674656  0.342139  5 -1.771765 -0.184457  1.0  1.0
2013-01-03  0.937461  0.708011  5 -1.414944  1.045815  2.0  5.0
2013-01-04 -0.245622  0.040975  5 -0.071897 -0.165725  3.0  5.0

In [66]:
pd.isna(df1)

                A      B      D      C      X      F      E
2013-01-01  False  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False   True
2013-01-04  False  False  False  False  False  False   True

# Operations

In [67]:
df.mean()

A    0.874409
B   -0.156900
D    5.000000
C   -0.556126
X    0.616012
F    3.000000
dtype: float64

In [68]:
df.mean(1)

2013-01-01    1.673800
2013-01-02    1.010095
2013-01-03    1.379391
2013-01-04    1.259622
2013-01-05    1.455607
2013-01-06    1.777848
Freq: D, dtype: float64

In [69]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [70]:
df.sub(s, axis="index")

                   A         B    D         C         X    F
2013-01-01       NaN       NaN  NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN  NaN       NaN       NaN  NaN
2013-01-03 -0.062539 -0.291989  4.0 -2.414944  0.045815  1.0
2013-01-04 -3.245622 -2.959025  2.0 -3.071897 -3.165725  0.0
2013-01-05 -4.727870 -5.830056  0.0 -5.587912 -4.120522 -1.0
2013-01-06       NaN       NaN  NaN       NaN       NaN  NaN

# Apply

In [71]:
df.apply(np.cumsum)

                   A         B   D         C         X     F
2013-01-01  1.101705  0.000000   5  0.055356  2.211939   NaN
2013-01-02  2.776361  0.342139  10 -1.716409  2.027482   1.0
2013-01-03  3.713822  1.050150  15 -3.131353  3.073296   3.0
2013-01-04  3.468201  1.091125  20 -3.203250  2.907571   6.0
2013-01-05  3.740330  0.261069  25 -3.791162  3.787049  10.0
2013-01-06  5.246456 -0.941402  30 -3.336754  3.696074  15.0

In [72]:
df

                   A         B  D         C         X    F
2013-01-01  1.101705  0.000000  5  0.055356  2.211939  NaN
2013-01-02  1.674656  0.342139  5 -1.771765 -0.184457  1.0
2013-01-03  0.937461  0.708011  5 -1.414944  1.045815  2.0
2013-01-04 -0.245622  0.040975  5 -0.071897 -0.165725  3.0
2013-01-05  0.272130 -0.830056  5 -0.587912  0.879478  4.0
2013-01-06  1.506126 -1.202471  5  0.454408 -0.090974  5.0

In [73]:
s = pd.Series(np.random.randint(0,7, size=10))
s.value_counts()

4    3
2    3
5    2
0    1
6    1
dtype: int64

# String methods

In [74]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge

## Concat

In [75]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.792875  2.166270  0.562020 -0.414189
1  0.636669  0.505163 -0.534926  0.017507
2  0.143420 -0.715386  0.750706 -0.152050
3 -0.252851 -0.390319  1.183648 -1.169422
4  0.653807  0.045046 -0.093372  0.668395
5  0.092979  0.209361 -0.637262 -0.328180
6 -0.503441 -1.744720 -0.496578  1.188151
7 -2.057159 -2.138303 -0.978603 -0.834907
8 -0.926348  0.466070  1.223915 -0.565706
9  0.134645  0.954043 -1.727925 -0.023678

In [76]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.792875  2.166270  0.562020 -0.414189
 1  0.636669  0.505163 -0.534926  0.017507
 2  0.143420 -0.715386  0.750706 -0.152050,
           0         1         2         3
 3 -0.252851 -0.390319  1.183648 -1.169422
 4  0.653807  0.045046 -0.093372  0.668395
 5  0.092979  0.209361 -0.637262 -0.328180
 6 -0.503441 -1.744720 -0.496578  1.188151,
           0         1         2         3
 7 -2.057159 -2.138303 -0.978603 -0.834907
 8 -0.926348  0.466070  1.223915 -0.565706
 9  0.134645  0.954043 -1.727925 -0.023678]

In [77]:
pd.concat(pieces)

          0         1         2         3
0  0.792875  2.166270  0.562020 -0.414189
1  0.636669  0.505163 -0.534926  0.017507
2  0.143420 -0.715386  0.750706 -0.152050
3 -0.252851 -0.390319  1.183648 -1.169422
4  0.653807  0.045046 -0.093372  0.668395
5  0.092979  0.209361 -0.637262 -0.328180
6 -0.503441 -1.744720 -0.496578  1.188151
7 -2.057159 -2.138303 -0.978603 -0.834907
8 -0.926348  0.466070  1.223915 -0.565706
9  0.134645  0.954043 -1.727925 -0.023678

# Join